# 함량 추출
def extraction(string, keyword) :
    lst = []
    for i in range(len(string)):
        if keyword in string[i]:
            if i > 0 and keyword == 'kcal' : lst.append(string[i-1])
            lst.append(string[i])
            if i < len(string)-1 : lst.append(string[i+1])
    for i in range(len(lst)):
        lst[i] = lst[i].replace(",","")
        lst[i] = lst[i].replace(keyword,"")
        lst[i] = lst[i].replace("mg","")
        lst[i] = lst[i].replace("g","")
        if is_num(lst[i]) :
            return float(lst[i])
    return 0
# 정수, 실수 판별
def is_num(string) :
    for i in range(len(string)) :
        if not string[i].isdigit() and string[i] != '.' :
            return False
        return True
string = ['총내용량', '114g', '요리하다', "'요리하다'", '는', '건강하고', '전문적인', '영양정보', '다양한 요리를', '가장', '쉽고', '470', 'kcal', 'YORIHADA', '간편하게', '레시피로', '한식을', '경험할', '비롯한', '전', '수있는', '세계의', 'HMR', '전문', '1일', '영양성분기준차에', '대한 비율', '브랜드입니다', '총내용량당', '소고기라면', '나트륨', '1,690', 'mg', '85%', '1000', '1200', '1400', '1600', '조리방법', '5', '23%', '800', '1800', '탄수화물', '74g', '~', '6', '7', '§', '2000', '당류3g', '3%', '물', '500', 'mL를', '끓인', '후', '면과', '0mg', 'mg', '분말스프를', '넣고', '3분', '30초간', '유탕면류', '트롤 빌딩 비교 표시', '지방', '15g', '28 %', '조리하여', '드십시오.', '美BMLVLUE', '트랜스지방', '0g', '24.09.20까지CUH', '나트륨(식염', '등)', '섭취를', '조절하기', '포화지방', '8g', '53%', '위하여', '분말스프는', '기호에', '따라', '적정량을', '넣어', '드십시오.', 'F1', '0%', '콜레스테롤0mg', '18%', '맛있게', '먹는', 'TIP', '단백질', '10g', '기호에', '따라', '소고기,', '계란,', '대파,', '버섯 등을', '기준이므로', '1일', '영양성분', '개인의', '기준치에', '필요', '열량에', '대한', '비율(%)은', '2.000', '↓ 를거리]', '있습니다.', 'kcal', '곁들여', '드시면', '더욱', '맛있습니다.', '8', '809695', '252785', 'TVLL', '비닐류', '오세시', '·', '유통전문판매업소', ':', '롯데쇼핑(주)', '/', '서울특별시', '중구', '남대문로', '81(소공동)', '/', '1899-3000', '주의하십시오.', '-본', '국물이', '뜨거우니', '화상에', '벌레으', 'SAMPARA', '후면', '표기일까지', '품목보고번호', '(F1)19830358021695', '/', '(F2)20120512055446', '제품은', '농산물', '원료를', '주로', '사용하여', '*', '면', '소맥분(밀', '미국산,', '호주산),', '팜유(말레이시아산),', '변성전분,', '영향을', '받기', '쉬우니', '포장이', '파손되지', '않도록', ':', '·', '독일산),', '정', '감자전분(덴마크산,', '보관에', '유의해', '주십시오.', '·알류,', '메밀,', '땅콩', '제소금,', '조미액', '글루텐,', '구아검,', '감미유S,', '혼합제제(폴리인산나트륨,', '마늘시즈닝분말,', '메타인산나트륨', '면류첨가알칼리제(탄산칼륨,', '메타인산칼륨),', '탄산나트륨,', '녹차풍미액,', '피로인산나트륨),', '비타민B2', '*', '스프', '시즈닝', ':', '정제', '게,', '홍합', '새우,', '포함)', '복숭아,', '혼입', '가능성이', '토마토,', '오징어,', '있습니다.', '조개류(금', '·본', '소금,', '맛분말,', '기맛분,', 'Z-글루탐산나트륨(향미증진제),', '고춧가루,', '양조간장분말,', '향미증진제', '조미분에이,', '3종,', '간장조미분말,', '설탕,', '장국베이스[소고기(호주산)],', '불고기맛분말[소고기(호주산)],', '조미양념분[소고기(호주산)],', '볶음양념분말,', '고풍미쇠고기', '쇠고', '품은', '기준에', '소비자기본법에', '의거', '교환', '또는', '따른', '안전관리인증', '소비자분쟁해', '매운맛베이스,', '치킨스톡분말,', '있습니다.', '비닐류', '프리카추출색소,', '분,', '조미맛분,', '건미역,', '고소한맛분말', '산도조절제,', '흑후추분말,', '세이보리분말,', '카라멜', '우유,', '돈골농축분말,', '대두,', '소IV', '밀,', '매운양념분말,', '돼지고기,', '풍미베이스,', '닭고기,', '비프시즈닝오일,', '분말된장,', '쇠고기', '조미마늘', '함유', '파', '국번없이', '보상', '·부정·불량식품신고는', '받을', '수', '1399', 'HACCP', '식품의약품안전처', 'OTH']

# 알레르기 주의사항
allergy = ['계란', '우유', '밀', '게', '새우', '생선', '호두', '돼지고기', '땅콩', '조개', '복숭아']
cautions = []
함유 = 0
for i in range(len(string)) :
    if string[i].replace(",","") == "함유" :
        print(i, string[i]);
        함유 = i

for i in range(함유-30,함유) :
    for j in range(len(allergy)) :
        if string[i].replace(",","") == allergy[j] :
            cautions.append(allergy[j])
print(cautions)
# 영양정보
energy = extraction(string,'kcal') # 열량
na = extraction(string,'나트륨') # 나트륨
cbh = extraction(string,'탄수화물') # 탄수화물
sugar = extraction(string, '당류') # 당류
fat = extraction(string, '지방') # 지방
transfat = extraction(string, '트랜스지방') # 트랜스 지방
saturatedfat = extraction(string, '포화지방') # 포화 지방
kol = extraction(string,'콜레스테롤') # 콜레스테롤
prot = extraction(string, '단백질') # 단백질

print("열량 :",energy,"kcal")
print("나트륨 :",na,"mg")
print("탄수화물 :",cbh,"g")
print("   당류 :",sugar,"g")
print("지방 :",fat,"g")
print("   트랜스지방 :",transfat,"g")
print("   포화지방 :",saturatedfat,"g")
print("콜레스테롤 :",kol,"mg")
print("단백질 :",prot,"g")

